<div style="font-family:'times new roman'; background-color:#093145; padding:35px; text-align:center; color:white">
    <h1>InMemDB</h1>
    <p>InMemDB is a python package that allows you to create a sqlite relational database in memory
     out of a pandas.DataFrame object or any array-like sequence type.<p>
</div>
<div style="font-family:'times new roman'; background-color:#f5f5f5; padding:30px; text-align:center; color:#093145">
    <h1>Advantages</h1><br>
    <div style="text-align:left; margin:auto; max-width:500px;">
        <ul>
            <li>Combines SQLilte with the best data manipulation and analysis tool Pandas</li>
            <li>Can be used to Extract, Transform, and Load data</li>
            <li>Those who are more familar with SQL can still manipulate the powerful pandas DataFrame</li>
        </ul>
    </div>
</div>

In [1]:
from InMemDB import InMemDB
import pandas as pd
import os
import re

In [2]:
db = InMemDB()

In [10]:
InMemDB.CreateTableDF?

In [3]:
os.chdir(r'lego-database')

In [4]:
# We will extract these csv files and load them into our db

tables = os.listdir()
tables

['part_categories.csv',
 'inventories.csv',
 'parts.csv',
 'inventory_sets.csv',
 'inventory_parts.csv',
 'colors.csv',
 'sets.csv',
 'themes.csv']

In [5]:
def name(i):
    return re.findall('[A-Za-z_A-Za-z]+',i)[0]

In [6]:
name('inventory_parts.csv')

'inventory_parts'

In [7]:
for i in tables:
    df = pd.read_csv(i)
    db.CreateTableDF(table_name=name(i),df=df)

In [8]:
db.TableNames()

['colors',
 'inventories',
 'inventory_parts',
 'inventory_sets',
 'part_categories',
 'parts',
 'sets',
 'themes']

In [9]:
q1='''
SELECT * FROM inventories;
'''

In [10]:
q2='''
SELECT * FROM inventory_parts;
'''

In [11]:
q3='''
SELECT * FROM sets;
'''

In [12]:
db.query(q1).head(3)

   id  version set_num
0   1        1  7922-1
1   3        1  3931-1
2   4        1  6942-1

In [13]:
db.query(q2).head(3)

   inventory_id  part_num  color_id  quantity is_spare
0             1  48379c01        72         1        f
1             1     48395         7         1        f
2             1  mcsport6        25         1        f

In [14]:
db.query(q3).head(3)

  set_num                        name  year  theme_id  num_parts
0    00-1             Weetabix Castle  1970       414        471
1  0011-2           Town Mini-Figures  1978        84         12
2  0011-3  Castle 2 for 1 Bonus Offer  1987       199          2

In [15]:
q4 = '''
SELECT i.id,
       s.name,
       i.version,
       i.set_num,
       ip.part_num,
       ip.color_id,
       ip.quantity,
       ip.is_spare

FROM inventories i
LEFT JOIN inventory_parts ip
ON i.id = ip.inventory_id
LEFT JOIN sets s
ON i.set_num = s.set_num
WHERE name = 'Butterfly Girl';
'''

In [16]:
df = db.query(q4)
df

,id,name,version,set_num,part_num,color_id,quantity,is_spare
0,18645,Butterfly Girl,1,71018-7,15427pr0173,226,1,f
1,18645,Butterfly Girl,1,71018-7,33647,45,1,f
2,18645,Butterfly Girl,1,71018-7,3626cpr2202,14,1,f
3,18645,Butterfly Girl,1,71018-7,3742,5,1,t
4,18645,Butterfly Girl,1,71018-7,3742,5,3,f
5,18645,Butterfly Girl,1,71018-7,41879bpr0010,29,1,f
6,18645,Butterfly Girl,1,71018-7,88646,0,1,f
7,18645,Butterfly Girl,1,71018-7,973pr3833c01,212,1,f
8,18645,Butterfly Girl,1,71018-7,99249,27,1,f

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        9 non-null      int64
 1   name      9 non-null      object
 2   version   9 non-null      int64
 3   set_num   9 non-null      object
 4   part_num  9 non-null      object
 5   color_id  9 non-null      int64
 6   quantity  9 non-null      int64
 7   is_spare  9 non-null      object
dtypes: int64(4), object(4)
memory usage: 704.0+ bytes

In [18]:
q5 = '''
SELECT i.id,
       s.name,
       i.version,
       i.set_num,
       ip.part_num,
       ip.color_id,
       ip.quantity,
       ip.is_spare

FROM inventories i
LEFT JOIN inventory_parts ip
ON i.id = ip.inventory_id
LEFT JOIN sets s
ON i.set_num = s.set_num

'''

In [19]:
db.query(q5).head(5)

,id,name,version,set_num,part_num,color_id,quantity,is_spare
0,1,McDonald's Sports Set Number 6 - Orange Vest S...,1,7922-1,48379c01,72.0,1.0,f
1,1,McDonald's Sports Set Number 6 - Orange Vest S...,1,7922-1,48395,7.0,1.0,f
2,1,McDonald's Sports Set Number 6 - Orange Vest S...,1,7922-1,mcsport6,25.0,1.0,f
3,1,McDonald's Sports Set Number 6 - Orange Vest S...,1,7922-1,paddle,0.0,1.0,f
4,3,Emma's Splash Pool,1,3931-1,11816pr0005,78.0,1.0,f

In [20]:
q6 = '''
SELECT name,
       set_num,
       sum(quantity) AS quantity
FROM
(
    SELECT i.id,
           s.name AS name,
           i.version,
           i.set_num AS set_num,
           ip.part_num,
           ip.color_id,
           ip.quantity AS quantity,
           ip.is_spare

    FROM inventories i
    LEFT JOIN inventory_parts ip
    ON i.id = ip.inventory_id
    LEFT JOIN sets s
    ON i.set_num = s.set_num
)
WHERE quantity IS NOT NULL
GROUP BY name, set_num
ORDER BY quantity DESC

'''

In [21]:
db.query(q6).head(20)

                                  name    set_num  quantity
0                            Taj Mahal    10189-1      5962
1   Star Wars / M&M Mosaic - Promo Set     SWMP-1      5462
2              Millennium Falcon - UCS    10179-1      5217
3               Window Exploration Bag  2000409-1      5200
4               Firehouse Headquarters    75827-1      4788
5         Personalised Mosaic Portrait    40179-1      4502
6                         Tower Bridge    10214-1      4335
7                              Big Ben    10253-1      4259
8                    The Disney Castle    71040-1      4194
9                      Assembly Square    10255-1      4147
10                          Death Star    75159-1      4094
11              Bucket Wheel Excavator    42055-1      3979
12                          Death Star    10188-1      3886
13                       Death Star II    10143-1      3460
14            Eiffel Tower 1:300 Scale    10181-1      3443
15                         Sandcrawler    75059-1      3366
16                      Grand Carousel    10196-1      3295
17                Super Star Destroyer    10221-1      3176
18       Imperial Star Destroyer - UCS    10030-1      3133
19              The SHIELD Helicarrier    76042-1      3079

In [23]:
db.TableNames()

['colors',
 'inventories',
 'inventory_parts',
 'inventory_sets',
 'part_categories',
 'parts',
 'sets',
 'themes']

In [24]:
db.DropTable('inventories')

'inventories has been deleted'

In [25]:
db.TableNames()

['colors',
 'inventory_parts',
 'inventory_sets',
 'part_categories',
 'parts',
 'sets',
 'themes']

In [26]:
db.query('Select * from parts')

      part_num                                               name  part_cat_id
0       0687b1                        Set 0687 Activity Booklet 1           17
1         0901  Baseplate 16 x 30 with Set 080 Yellow House Print            1
2         0902  Baseplate 16 x 24 with Set 080 Small White Hou...            1
3         0903     Baseplate 16 x 24 with Set 080 Red House Print            1
4         0904  Baseplate 16 x 24 with Set 080 Large White Hou...            1
...        ...                                                ...          ...
25988   zbb013              Znap Connector 3 x 3 - 4 way B (Beam)           43
25989   zbb014                     Znap Connector 1 x 3 - 2 way A           43
25990   zbb015                                Znap Beam 3, 1 Hole           43
25991   zbb018            Znap Connector 3 x 3 - 4 way C (Closed)           43
25992   zbb022                  Wheel 68mm Znap Propeller (9 x 2)           29

[25993 rows x 3 columns]

In [28]:
db.DropTable('Customer')

'Customer is not a table in the current database.'